# ************************************************************
# Sequel Ace SQL dump
# バージョン 20048
#
# https://sequel-ace.com/
# https://github.com/Sequel-Ace/Sequel-Ace
#
# ホスト: localhost (MySQL 8.0.32)
# データベース: Thingumo_development
# 生成時間: 2023-07-27 16:02:28 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
SET NAMES utf8mb4;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE='NO_AUTO_VALUE_ON_ZERO', SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# テーブルのダンプ categories
# ------------------------------------------------------------

CREATE TABLE `categories` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

LOCK TABLES `categories` WRITE;
/*!40000 ALTER TABLE `categories` DISABLE KEYS */;

INSERT INTO `categories` (`id`, `name`, `created_at`, `updated_at`)
VALUES
	(1,'芸能','2022-07-13 14:02:49','2022-07-13 14:02:49'),
	(2,'音楽','2022-07-13 14:03:09','2022-07-13 14:03:09'),
	(3,'映画','2022-07-13 14:03:19','2022-07-13 14:03:19'),
	(4,'アニメ','2022-07-13 14:03:30','2022-07-13 14:03:30'),
	(5,'マンガ','2022-07-13 14:03:56','2022-07-13 14:03:56'),
	(6,'ゲーム','2022-07-13 14:04:21','2022-07-13 14:04:21'),
	(7,'芸術','2022-07-13 14:04:47','2022-07-13 14:04:47'),
	(8,'おもちゃ','2022-07-13 14:05:24','2022-07-13 14:05:24'),
	(9,'本','2022-07-13 14:05:55','2022-07-13 14:05:55'),
	(10,'雑誌','2022-07-13 14:06:10','2022-07-13 14:06:10'),
	(11,'料理','2022-07-13 14:06:27','2022-07-13 14:06:27'),
	(12,'建物','2022-07-13 14:07:02','2022-07-13 14:07:02'),
	(13,'場所','2022-07-13 14:07:23','2022-07-13 14:07:23'),
	(14,'雑貨','2022-07-13 14:07:46','2022-07-13 14:07:46'),
	(15,'生き物','2022-07-13 14:07:55','2022-07-13 14:07:55'),
	(16,'健康','2022-07-13 14:08:26','2022-07-13 14:08:26'),
	(17,'美容','2022-07-13 14:08:38','2022-07-13 14:08:38'),
	(18,'ファッション','2022-07-13 14:08:47','2022-07-13 14:08:47'),
	(19,'乗り物','2022-07-13 14:09:04','2022-07-13 14:09:04'),
	(20,'インターネット','2022-07-13 14:09:18','2022-07-13 14:09:18'),
	(21,'コンピュータ','2022-07-13 14:09:49','2022-07-13 14:09:49'),
	(22,'携帯電話','2022-07-13 14:11:31','2022-07-13 14:11:31'),
	(23,'家電','2022-07-13 14:11:40','2022-07-13 14:11:40'),
	(24,'IT','2022-07-13 14:11:51','2022-07-13 14:11:51'),
	(25,'言語','2022-07-13 14:12:20','2022-07-13 14:12:20'),
	(26,'歴史','2022-07-13 14:12:41','2022-07-13 14:12:41'),
	(27,'経済','2022-07-13 14:12:52','2022-07-13 14:12:52'),
	(28,'政治','2022-07-13 14:13:06','2022-07-13 14:13:06'),
	(29,'スポーツ','2022-07-13 14:13:25','2022-07-13 14:13:25'),
	(30,'交通','2022-07-13 14:13:35','2022-07-13 14:13:35'),
	(31,'ギャンブル','2022-07-13 14:13:49','2022-07-13 14:13:49'),
	(32,'その他','2022-07-13 14:14:08','2022-07-13 14:14:08');

/*!40000 ALTER TABLE `categories` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
